test_examples/tube_OpenFoam3d_abaqus3d/Test_Restart/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startTime 0.;

endTime 0.0001;

deltaT          1e-05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      fixed;

timePrecision   6;

runTimeModifiable yes;

functions
{
    wallShearStress
    {
        type            wallShearStress;
        libs            ( "libfieldFunctionObjects.so" );
        patches         ( "mantle" );
        writePrecision  8;
        writeToFile     true;
        writeControl    timeStep;
        writeInterval   1;
        log             true;
    }

    writeObjects1
    {
        type        writeObjects;
        libs        ("libutilityFunctionObjects.so");
        exclusiveWriting     false;
        objects     (pointDisplacement);
        writeControl    timeStep;
        writeInterval   1;

    }

     pressure 
     { 
	type  	 pressure; 
	libs 	 ("libfieldFunctionObjects.so"); 
	patches ( "mantle" ); 
        writeControl 	 timeStep; 
	writeInterval 	 1; 
	writeToFile 	 true; 
	calcTotal 	 no; 
	calcCoeff 	 no; 
	rho 	 rho; 
	 } 
} 


}


// ************************************************************************* //
